// 2023-04-17 16:21
#include <neon.h>
#include <neon_test.h>
/* NOTE: 与 mla 基本相同, 但不支持 float */
// int8x8_t vaba_s8(int8x8_t a,int8x8_t b,int8x8_t c)
// int16x4_t vaba_s16(int16x4_t a,int16x4_t b,int16x4_t c)
// int32x2_t vaba_s32(int32x2_t a,int32x2_t b,int32x2_t c)
// uint8x8_t vaba_u8(uint8x8_t a,uint8x8_t b,uint8x8_t c)
// uint16x4_t vaba_u16(uint16x4_t a,uint16x4_t b,uint16x4_t c)
// uint32x2_t vaba_u32(uint32x2_t a,uint32x2_t b,uint32x2_t c)
//
// int8x16_t vabaq_s8(int8x16_t a,int8x16_t b,int8x16_t c)
// int16x8_t vabaq_s16(int16x8_t a,int16x8_t b,int16x8_t c)
// int32x4_t vabaq_s32(int32x4_t a,int32x4_t b,int32x4_t c)
// uint8x16_t vabaq_u8(uint8x16_t a,uint8x16_t b,uint8x16_t c)
// uint16x8_t vabaq_u16(uint16x8_t a,uint16x8_t b,uint16x8_t c)
// uint32x4_t vabaq_u32(uint32x4_t a,uint32x4_t b,uint32x4_t c)

TEST_CASE(test_vaba_s8) {
    static const struct {
        int8_t a[8];
        int8_t b[8];
        int8_t c[8];
        int8_t r[8];
    } test_vec[] = {
        {{-63, -30, 29, -57, -97, -25, -66, -96},
         {-103, 34, 89, 7, -11, 119, -68, 2},
         {18, 15, 41, -14, -24, INT8_MIN, -66, -116},
         {58, -11, 77, -36, -84, -34, -64, 22}},
        {{10, -95, -46, 88, 46, 34, 80, -17},
         {4, 109, -73, -93, 85, 117, 67, -18},
         {-104, -99, -10, -115, 20, -78, -113, 39},
         {118, 113, 17, 110, 111, -27, 4, 40}},
        {{-62, -71, 25, -86, 57, -40, 55, 67},
         {121, 9, -101, -89, 43, -20, -105, 47},
         {89, 78, -45, -82, -61, 22, -99, 91},
         {-30, -2, 81, -79, -95, 2, 61, 111}},
        {{-77, -109, -23, -56, 69, 120, -17, 7},
         {49, 8, -78, 106, -32, -23, -83, 89},
         {-14, 73, 1, 29, 53, -104, 76, -114},
         {-14, -44, 56, 21, -102, -55, -114, -46}},
        {{-26, 31, 61, -87, 54, -38, 5, -23},
         {109, -18, -79, -78, 102, -96, -70, -104},
         {-87, 108, 2, -119, 85, -80, -29, 71},
         {-86, -99, -114, -46, 71, -22, 46, -104}},
        {{-7, -28, 100, 46, 124, -80, -68, 98},
         {-48, -7, 11, 6, -45, 16, -17, 64},
         {-2, -95, -13, 101, 65, -83, -3, -22},
         {39, 60, 124, -115, -22, 19, -54, -72}},
        {{25, -1, 116, 110, -81, 87, -75, -88},
         {59, 25, -42, -73, -55, -109, 25, -103},
         {-116, 36, -97, 96, 53, -113, -96, 51},
         {-56, 10, -85, 23, 27, 91, 46, 66}},
        {{48, -109, -104, 113, 64, -107, 92, 89},
         {-107, -48, -57, 68, 39, 124, -19, 98},
         {-107, -61, 25, 95, 86, 50, -8, -29},
         {48, -96, -22, -116, 111, -33, 103, -40}}};

    for (size_t i = 0; i < (sizeof(test_vec) / sizeof(test_vec[0])); i++) {
        int8x8_t a = vld1_s8(test_vec[i].a);
        int8x8_t b = vld1_s8(test_vec[i].b);
        int8x8_t c = vld1_s8(test_vec[i].c);
        int8x8_t r = vaba_s8(a, b, c);
        int8x8_t check = vld1_s8(test_vec[i].r);
        ASSERT_EQUAL(r, check);
    }
    return 0;
}
